cylinder_pisoFoam_RAS/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication snappyHexMesh -overwrite
runApplication topoSet
runApplication createPatch -overwrite
runApplication pisoFoam &
#runApplication -s sigma        postProcess -func "components(sigma)"
#runApplication -s singleGraph  postProcess -func singleGraph

#------------------------------------------------------------------------------
